<div class="callback m-100">
    <div class="container">
        <div class="callback__in card">
            <div class="callback__header">
                <h2>
                    проконсультируем
                    <br>прямо сейчас
                </h2>
                <div class="callback__sub">
                    Позвоните или напишите нам, мы онлайн.
                </div>
            </div>
            <div class="callback__buttons">
                <div class="callback__main">
                    <a class="" href="tel:<?= get_field('phone', 'option') ?>" data-toggle="modal" data-target="#callback-modal">
                        <svg class="fs" width="18" height="19" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M9.86377 16.3701C11.7646 17.2394 14.0416 17.7578 16.7578 17.7578V13.5684L12.8184 12.521L9.86377 16.3701ZM9.86377 16.3701C6.08091 14.6398 3.78125 11.5208 2.47729 8.33154M2.47729 8.33154C1.39395 5.68381 1 2.9879 1 1H4.93945L5.92432 5.18945L2.47729 8.33154Z" stroke="#008EE9" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
                        </svg>
                        Позвонить
                    </a>
                </div>
                <div class="callback__social">
                    <a href="<?= get_field('vk', 'option') ?>" class="social-vk" target="_blank">
                        <svg class="fs" width="30" height="18" viewBox="0 0 30 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M0 0C0.243598 11.2432 6.08994 18 16.3398 18H16.9207V11.5676C20.6871 11.9279 23.5353 14.5766 24.6783 18H30C28.5384 12.8829 24.6971 10.0541 22.2986 8.97297C24.6971 7.63964 28.07 4.3964 28.8757 0H24.0412C22.9919 3.56757 19.8813 6.81081 16.9207 7.11712V0H12.0862V12.4685C9.08807 11.7477 5.30294 8.25225 5.13429 0H0Z" fill="white" />
                        </svg>
                    </a>
                    <a href="<?= get_field('wa', 'option') ?>" class="social-wa" target="_blank">
                        <svg class="fs" width="26" height="26" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M11.2364 21.9372C9.07734 21.9372 8.074 21.6207 6.32997 20.3545C5.22682 21.7789 1.73352 22.8922 1.58118 20.9876C1.58118 19.5578 1.26599 18.3496 0.908783 17.0306C0.483284 15.4056 0 13.596 0 10.9739C0 4.71138 5.11651 0 11.1786 0C17.2459 0 21.9999 4.94352 21.9999 11.0319C22.0203 17.0262 17.2046 21.9052 11.2364 21.9372ZM11.3257 5.41308C8.37342 5.26008 6.07257 7.31241 5.56302 10.5307C5.14277 13.195 5.88871 16.4397 6.52433 16.6086C6.82901 16.6824 7.59596 16.0599 8.074 15.5798C8.86444 16.1282 9.78491 16.4576 10.7426 16.5347C13.8016 16.6825 16.4154 14.3435 16.6208 11.2746C16.7403 8.1992 14.3851 5.59435 11.3257 5.41836L11.3257 5.41308Z" fill="#fff" />
                        </svg>
                    </a>
                    <a href="<?= get_field('tg', 'option') ?>" class="social-tg" target="_blank">
                        <svg class="fs" width="32" height="26" viewBox="0 0 32 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M1.92638 11.3251C1.92638 11.3251 15.837 5.6101 20.6623 3.60044C22.5149 2.79448 28.7847 0.219602 28.7847 0.219602C28.7847 0.219602 31.6736 -0.910833 31.4328 1.83152C31.3491 2.96195 30.7106 6.89754 30.0616 11.1576C29.0987 17.1866 28.052 23.7808 28.052 23.7808C28.052 23.7808 27.895 25.6335 26.5238 25.9475C25.1526 26.2719 22.9022 24.8275 22.5045 24.503C22.18 24.2623 16.4755 20.6407 14.3821 18.8718C13.8169 18.3903 13.1784 17.4273 14.4658 16.2969C17.3547 13.6487 20.8193 10.3516 22.9022 8.25825C23.8652 7.29529 24.8281 5.04488 20.8088 7.77677C15.1043 11.7124 9.47307 15.4177 9.47307 15.4177C9.47307 15.4177 8.18563 16.2236 5.77823 15.5014C3.37082 14.7792 0.555199 13.8162 0.555199 13.8162C0.555199 13.8162 -1.37073 12.6125 1.92638 11.3251Z" fill="white" />
                        </svg>
                    </a>
                </div>
            </div>
        </div>
    </div>
</div>