<div id="lead-modal" class="modal">
    <div class="modal-content">
        <span class="close"></span>

        <div class="modal-title">
            Забронировать время
        </div>
        <!--noindex-->
        <div class="modal-sub">
            Оставьте свои контакты. Мы свяжемся с вами
            <br> и подберем удобное для вас время.
        </div><!--/noindex-->

        <form action="/lead.php" method="POST" class="form">

            <input type="hidden" name="subject" value="Забронировать время">

            <div class="form-group">
                <input type="text" name="fio" placeholder="*Имя">
            </div>
            <div class="form-group">
                <input type="text" name="tel" required="" placeholder="*Телефон">
            </div>
            <!--noindex-->
            <div class="form-group form-group__terms">
                <label for="term-2">
                    <input type="checkbox" id="term-2" required>
                    <div>
                        Я выражаю <a href="/soglasie-na-obrabotku-personalnyh-dannyh/" target="_blank">Согласие на передачу и обработку персональных данных</a>, в соответствии с <a href="/privacy-policy/" target="_blank">Политикой конфиденциальности</a>
                    </div>
                </label>
            </div>

            <div class="form__submit">
                <button type="submit" class="btn">Забронировать</button>
            </div>

        </form>

    </div>
</div><!--/noindex-->

<div id="question-modal" class="modal">
    <div class="modal-content">
        <span class="close"></span>

        <div class="modal-title">
            Задать вопрос
        </div>
        <!--noindex-->
        <div class="modal-sub">
            Оставьте свои контакты. Мы свяжемся с вами
            <br> и подберем удобное для вас время.
        </div><!--/noindex-->

        <form action="/lead.php" method="POST" class="form">

            <input type="hidden" name="subject" value="Задать вопрос">

            <div class="form-group">
                <input type="text" name="fio" placeholder="*Имя">
            </div>
            <div class="form-group">
                <input type="text" name="tel" required="" placeholder="*Телефон">
            </div>
            <div class="form-group">
                <textarea name="question" id="" placeholder="Ваш вопрос" rows="4" required></textarea>
            </div>

            <!--noindex-->
            <div class="form-group form-group__terms">
                <label for="term-3">
                    <input type="checkbox" id="term-3" required>
                    <div>
                        Я выражаю <a href="/soglasie-na-obrabotku-personalnyh-dannyh/" target="_blank">Согласие на передачу и обработку персональных данных</a>, в соответствии с <a href="/privacy-policy/" target="_blank">Политикой конфиденциальности</a>
                    </div>
                </label>
            </div>

            <div class="form__submit">
                <button type="submit" class="btn">Отправить вопрос</button>
            </div>

        </form>

    </div>
</div><!--/noindex-->

<div id="master-modal" class="blue-modal modal">
    <div class="modal-content">
        <span class="close"></span>

        <div class="modal-title">
            Заказать выезд мастера
        </div>
        <!--noindex-->
        <div class="modal-sub">
            Оставьте ваши контакты, мы свяжемся с вами
        </div><!--/noindex-->

        <form action="/lead.php" method="POST" class="form">
            <input type="hidden" name="subject" value="Выезд мастера">

            <div class="form-group">
                <input type="text" name="fio" placeholder="*Имя">
            </div>
            <div class="form-group">
                <input type="text" name="tel" required="" placeholder="*Телефон">
            </div>
            <!--noindex-->
            <div class="form-group form-group__terms">
                <label for="term-4">
                    <input type="checkbox" id="term-4" required>
                    <div>
                        Я выражаю <a href="/soglasie-na-obrabotku-personalnyh-dannyh/" target="_blank">Согласие на передачу и обработку персональных данных</a>, в соответствии с <a href="/privacy-policy/" target="_blank">Политикой конфиденциальности</a>
                    </div>
                </label>
            </div>

            <div class="form__submit">
                <button type="submit" class="btn">Вызвать мастера</button>
            </div>

        </form>

    </div>
</div><!--/noindex-->

<div id="delivery-modal" class="blue-modal modal">
    <div class="modal-content">
        <span class="close"></span>

        <div class="modal-title">
            Заказать доставку техники
        </div>
        <!--noindex-->
        <div class="modal-sub">
            Оставьте ваши контакты, мы свяжемся с вами
        </div><!--/noindex-->

        <form action="/lead.php" method="POST" class="form">
            <input type="hidden" name="subject" value="Заказать доставку">
            <div class="form-group">
                <input type="text" name="fio" placeholder="*Имя">
            </div>
            <div class="form-group">
                <input type="text" name="tel" required="" placeholder="*Телефон">
            </div>
            <!--noindex-->
            <div class="form-group form-group__terms">
                <label for="term-5">
                    <input type="checkbox" id="term-5" required>
                    <div>
                        Я выражаю <a href="/soglasie-na-obrabotku-personalnyh-dannyh/" target="_blank">Согласие на передачу и обработку персональных данных</a>, в соответствии с <a href="/privacy-policy/" target="_blank">Политикой конфиденциальности</a>
                    </div>
                </label>
            </div>

            <div class="form__submit">
                <button type="submit" class="btn">Заказать доставку</button>
            </div>

        </form>

    </div>
</div><!--/noindex-->

<div id="rating-modal" class="modal">
    <div class="modal-content">
        <span class="close" data-modal="rating-modal"></span>

        <div class="modal-title">
            Оцените<br>нашу работу
        </div>

        <div class="stars-container">
            <span class="star" data-rating="1">
                <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M10 0.5C10.2337 0.5 10.5 0.624531 10.9072 1.15625C11.3146 1.68829 11.7687 2.50113 12.4102 3.65137L12.7383 4.23926C13.0765 4.84625 13.3096 5.28495 13.6924 5.57617C14.0789 5.87022 14.5583 5.96802 15.2148 6.11621V6.11523L15.8506 6.25977C17.0974 6.54207 17.974 6.74223 18.5811 6.98145C19.1041 7.18763 19.3286 7.38504 19.4297 7.60254L19.4658 7.69629C19.5467 7.95655 19.5016 8.27567 19.1465 8.83984C18.7881 9.40913 18.1896 10.112 17.3408 11.1045L16.9062 11.6123C16.5139 12.0714 16.2153 12.4092 16.0498 12.7979L15.9863 12.9688C15.8426 13.4323 15.8998 13.9236 15.9678 14.625V14.626L16.0332 15.3027C16.1612 16.6269 16.2511 17.5653 16.2207 18.248C16.1903 18.9301 16.0441 19.2087 15.8428 19.3613C15.6495 19.5079 15.3682 19.568 14.749 19.3906C14.1234 19.2114 13.3015 18.8341 12.1348 18.2969H12.1338L11.5361 18.0225C10.9239 17.7397 10.4819 17.5254 10 17.5254C9.63826 17.5254 9.29919 17.6463 8.89355 17.8262L8.46387 18.0225L7.86719 18.2969C6.69991 18.8341 5.87776 19.2112 5.25195 19.3906C4.63224 19.5683 4.35087 19.5084 4.1582 19.3623C3.95637 19.209 3.80977 18.9296 3.7793 18.248C3.7488 17.5653 3.83879 16.6269 3.9668 15.3027L4.0332 14.627V14.626C4.09264 14.0118 4.14333 13.558 4.05762 13.1436L4.0127 12.9678C3.86866 12.5022 3.54202 12.1357 3.09473 11.6133L2.66016 11.1055V11.1045C1.81121 10.1123 1.2119 9.41012 0.853516 8.84082C0.498501 8.27681 0.454184 7.95723 0.535156 7.69629C0.61431 7.44122 0.820935 7.21616 1.41895 6.98047C2.02625 6.74111 2.90352 6.54158 4.15039 6.25977L4.78711 6.11523L4.78613 6.11426C5.44245 5.96591 5.92049 5.86962 6.30762 5.57617C6.69196 5.28467 6.92408 4.84513 7.26172 4.23926L7.58984 3.65137C8.23144 2.50085 8.68629 1.68832 9.09375 1.15625C9.50083 0.624709 9.76632 0.500083 10 0.5Z" stroke="#FFBE42" />
                </svg>
            </span>
            <span class="star" data-rating="2">
                <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M10 0.5C10.2337 0.5 10.5 0.624531 10.9072 1.15625C11.3146 1.68829 11.7687 2.50113 12.4102 3.65137L12.7383 4.23926C13.0765 4.84625 13.3096 5.28495 13.6924 5.57617C14.0789 5.87022 14.5583 5.96802 15.2148 6.11621V6.11523L15.8506 6.25977C17.0974 6.54207 17.974 6.74223 18.5811 6.98145C19.1041 7.18763 19.3286 7.38504 19.4297 7.60254L19.4658 7.69629C19.5467 7.95655 19.5016 8.27567 19.1465 8.83984C18.7881 9.40913 18.1896 10.112 17.3408 11.1045L16.9062 11.6123C16.5139 12.0714 16.2153 12.4092 16.0498 12.7979L15.9863 12.9688C15.8426 13.4323 15.8998 13.9236 15.9678 14.625V14.626L16.0332 15.3027C16.1612 16.6269 16.2511 17.5653 16.2207 18.248C16.1903 18.9301 16.0441 19.2087 15.8428 19.3613C15.6495 19.5079 15.3682 19.568 14.749 19.3906C14.1234 19.2114 13.3015 18.8341 12.1348 18.2969H12.1338L11.5361 18.0225C10.9239 17.7397 10.4819 17.5254 10 17.5254C9.63826 17.5254 9.29919 17.6463 8.89355 17.8262L8.46387 18.0225L7.86719 18.2969C6.69991 18.8341 5.87776 19.2112 5.25195 19.3906C4.63224 19.5683 4.35087 19.5084 4.1582 19.3623C3.95637 19.209 3.80977 18.9296 3.7793 18.248C3.7488 17.5653 3.83879 16.6269 3.9668 15.3027L4.0332 14.627V14.626C4.09264 14.0118 4.14333 13.558 4.05762 13.1436L4.0127 12.9678C3.86866 12.5022 3.54202 12.1357 3.09473 11.6133L2.66016 11.1055V11.1045C1.81121 10.1123 1.2119 9.41012 0.853516 8.84082C0.498501 8.27681 0.454184 7.95723 0.535156 7.69629C0.61431 7.44122 0.820935 7.21616 1.41895 6.98047C2.02625 6.74111 2.90352 6.54158 4.15039 6.25977L4.78711 6.11523L4.78613 6.11426C5.44245 5.96591 5.92049 5.86962 6.30762 5.57617C6.69196 5.28467 6.92408 4.84513 7.26172 4.23926L7.58984 3.65137C8.23144 2.50085 8.68629 1.68832 9.09375 1.15625C9.50083 0.624709 9.76632 0.500083 10 0.5Z" stroke="#FFBE42" />
                </svg>
            </span>
            <span class="star" data-rating="3">
                <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M10 0.5C10.2337 0.5 10.5 0.624531 10.9072 1.15625C11.3146 1.68829 11.7687 2.50113 12.4102 3.65137L12.7383 4.23926C13.0765 4.84625 13.3096 5.28495 13.6924 5.57617C14.0789 5.87022 14.5583 5.96802 15.2148 6.11621V6.11523L15.8506 6.25977C17.0974 6.54207 17.974 6.74223 18.5811 6.98145C19.1041 7.18763 19.3286 7.38504 19.4297 7.60254L19.4658 7.69629C19.5467 7.95655 19.5016 8.27567 19.1465 8.83984C18.7881 9.40913 18.1896 10.112 17.3408 11.1045L16.9062 11.6123C16.5139 12.0714 16.2153 12.4092 16.0498 12.7979L15.9863 12.9688C15.8426 13.4323 15.8998 13.9236 15.9678 14.625V14.626L16.0332 15.3027C16.1612 16.6269 16.2511 17.5653 16.2207 18.248C16.1903 18.9301 16.0441 19.2087 15.8428 19.3613C15.6495 19.5079 15.3682 19.568 14.749 19.3906C14.1234 19.2114 13.3015 18.8341 12.1348 18.2969H12.1338L11.5361 18.0225C10.9239 17.7397 10.4819 17.5254 10 17.5254C9.63826 17.5254 9.29919 17.6463 8.89355 17.8262L8.46387 18.0225L7.86719 18.2969C6.69991 18.8341 5.87776 19.2112 5.25195 19.3906C4.63224 19.5683 4.35087 19.5084 4.1582 19.3623C3.95637 19.209 3.80977 18.9296 3.7793 18.248C3.7488 17.5653 3.83879 16.6269 3.9668 15.3027L4.0332 14.627V14.626C4.09264 14.0118 4.14333 13.558 4.05762 13.1436L4.0127 12.9678C3.86866 12.5022 3.54202 12.1357 3.09473 11.6133L2.66016 11.1055V11.1045C1.81121 10.1123 1.2119 9.41012 0.853516 8.84082C0.498501 8.27681 0.454184 7.95723 0.535156 7.69629C0.61431 7.44122 0.820935 7.21616 1.41895 6.98047C2.02625 6.74111 2.90352 6.54158 4.15039 6.25977L4.78711 6.11523L4.78613 6.11426C5.44245 5.96591 5.92049 5.86962 6.30762 5.57617C6.69196 5.28467 6.92408 4.84513 7.26172 4.23926L7.58984 3.65137C8.23144 2.50085 8.68629 1.68832 9.09375 1.15625C9.50083 0.624709 9.76632 0.500083 10 0.5Z" stroke="#FFBE42" />
                </svg>
            </span>
            <span class="star" data-rating="4">
                <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M10 0.5C10.2337 0.5 10.5 0.624531 10.9072 1.15625C11.3146 1.68829 11.7687 2.50113 12.4102 3.65137L12.7383 4.23926C13.0765 4.84625 13.3096 5.28495 13.6924 5.57617C14.0789 5.87022 14.5583 5.96802 15.2148 6.11621V6.11523L15.8506 6.25977C17.0974 6.54207 17.974 6.74223 18.5811 6.98145C19.1041 7.18763 19.3286 7.38504 19.4297 7.60254L19.4658 7.69629C19.5467 7.95655 19.5016 8.27567 19.1465 8.83984C18.7881 9.40913 18.1896 10.112 17.3408 11.1045L16.9062 11.6123C16.5139 12.0714 16.2153 12.4092 16.0498 12.7979L15.9863 12.9688C15.8426 13.4323 15.8998 13.9236 15.9678 14.625V14.626L16.0332 15.3027C16.1612 16.6269 16.2511 17.5653 16.2207 18.248C16.1903 18.9301 16.0441 19.2087 15.8428 19.3613C15.6495 19.5079 15.3682 19.568 14.749 19.3906C14.1234 19.2114 13.3015 18.8341 12.1348 18.2969H12.1338L11.5361 18.0225C10.9239 17.7397 10.4819 17.5254 10 17.5254C9.63826 17.5254 9.29919 17.6463 8.89355 17.8262L8.46387 18.0225L7.86719 18.2969C6.69991 18.8341 5.87776 19.2112 5.25195 19.3906C4.63224 19.5683 4.35087 19.5084 4.1582 19.3623C3.95637 19.209 3.80977 18.9296 3.7793 18.248C3.7488 17.5653 3.83879 16.6269 3.9668 15.3027L4.0332 14.627V14.626C4.09264 14.0118 4.14333 13.558 4.05762 13.1436L4.0127 12.9678C3.86866 12.5022 3.54202 12.1357 3.09473 11.6133L2.66016 11.1055V11.1045C1.81121 10.1123 1.2119 9.41012 0.853516 8.84082C0.498501 8.27681 0.454184 7.95723 0.535156 7.69629C0.61431 7.44122 0.820935 7.21616 1.41895 6.98047C2.02625 6.74111 2.90352 6.54158 4.15039 6.25977L4.78711 6.11523L4.78613 6.11426C5.44245 5.96591 5.92049 5.86962 6.30762 5.57617C6.69196 5.28467 6.92408 4.84513 7.26172 4.23926L7.58984 3.65137C8.23144 2.50085 8.68629 1.68832 9.09375 1.15625C9.50083 0.624709 9.76632 0.500083 10 0.5Z" stroke="#FFBE42" />
                </svg>
            </span>
            <span class="star" data-rating="5">
                <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M10 0.5C10.2337 0.5 10.5 0.624531 10.9072 1.15625C11.3146 1.68829 11.7687 2.50113 12.4102 3.65137L12.7383 4.23926C13.0765 4.84625 13.3096 5.28495 13.6924 5.57617C14.0789 5.87022 14.5583 5.96802 15.2148 6.11621V6.11523L15.8506 6.25977C17.0974 6.54207 17.974 6.74223 18.5811 6.98145C19.1041 7.18763 19.3286 7.38504 19.4297 7.60254L19.4658 7.69629C19.5467 7.95655 19.5016 8.27567 19.1465 8.83984C18.7881 9.40913 18.1896 10.112 17.3408 11.1045L16.9062 11.6123C16.5139 12.0714 16.2153 12.4092 16.0498 12.7979L15.9863 12.9688C15.8426 13.4323 15.8998 13.9236 15.9678 14.625V14.626L16.0332 15.3027C16.1612 16.6269 16.2511 17.5653 16.2207 18.248C16.1903 18.9301 16.0441 19.2087 15.8428 19.3613C15.6495 19.5079 15.3682 19.568 14.749 19.3906C14.1234 19.2114 13.3015 18.8341 12.1348 18.2969H12.1338L11.5361 18.0225C10.9239 17.7397 10.4819 17.5254 10 17.5254C9.63826 17.5254 9.29919 17.6463 8.89355 17.8262L8.46387 18.0225L7.86719 18.2969C6.69991 18.8341 5.87776 19.2112 5.25195 19.3906C4.63224 19.5683 4.35087 19.5084 4.1582 19.3623C3.95637 19.209 3.80977 18.9296 3.7793 18.248C3.7488 17.5653 3.83879 16.6269 3.9668 15.3027L4.0332 14.627V14.626C4.09264 14.0118 4.14333 13.558 4.05762 13.1436L4.0127 12.9678C3.86866 12.5022 3.54202 12.1357 3.09473 11.6133L2.66016 11.1055V11.1045C1.81121 10.1123 1.2119 9.41012 0.853516 8.84082C0.498501 8.27681 0.454184 7.95723 0.535156 7.69629C0.61431 7.44122 0.820935 7.21616 1.41895 6.98047C2.02625 6.74111 2.90352 6.54158 4.15039 6.25977L4.78711 6.11523L4.78613 6.11426C5.44245 5.96591 5.92049 5.86962 6.30762 5.57617C6.69196 5.28467 6.92408 4.84513 7.26172 4.23926L7.58984 3.65137C8.23144 2.50085 8.68629 1.68832 9.09375 1.15625C9.50083 0.624709 9.76632 0.500083 10 0.5Z" stroke="#FFBE42" />
                </svg>
            </span>
        </div>

        <button type="button" class="btn" id="submit-rating" disabled>Отправить</button>
    </div>
</div>

<!-- Модальное окно 2: Положительная оценка - отзывы на агрегаторах -->
<div id="review-aggregator-modal" class="modal">
    <div class="modal-content">
        <span class="close" data-modal="review-aggregator-modal"></span>

        <div class="modal-title">
            Спасибо<br>за оценку<br>нашей работы
        </div>

        <div class="review-aggregator__icon">
            <img src="/img/problems/bot.png" alt="">
        </div>

        <!--noindex-->
        <div class="modal-sub">
            Оставьте отзыв на карте
        </div><!--/noindex-->

        <div class="aggregator-buttons">
            <a href="<?= get_field('yandex_map', 'option') ?>" target="_blank" class="aggregator-btn yandex">Яндекс</a>
            <a href="<?= get_field('gis_map', 'option') ?>" target="_blank" class="aggregator-btn 2gis">2GIS</a>
            <a href="<?= get_field('google_map', 'option') ?>" target="_blank" class="aggregator-btn google">Google</a>
        </div>
    </div>
</div>

<!-- Модальное окно 3: Отрицательная оценка - форма обратной связи -->
<div id="feedback-modal" class="modal">
    <div class="modal-content">
        <span class="close" data-modal="feedback-modal"></span>

        <div class="modal-title">
            Расскажите, что не так
        </div>

        <!--noindex-->
        <div class="modal-sub">
            Мы хотим стать лучше, поэтому передадим<br>ваш отзыв в нашу службу заботы о клиенте
        </div><!--/noindex-->

        <form action="/lead.php" method="POST" class="form">

            <input type="hidden" name="subject" value="Расскажите, что не так">

            <div class="form-group">
                <input type="text" name="fio" placeholder="*Имя" required>
            </div>
            <div class="form-group">
                <input type="text" name="tel" placeholder="*Телефон" required>
            </div>
            <div class="form-group">
                <textarea name="feedback" placeholder="Ваш отзыв" required></textarea>
            </div>
            <!--noindex-->
            <div class="form-group form-group__terms">
                <label for="term-feedback">
                    <input type="checkbox" id="term-feedback" name="terms" required>
                    <div>
                        Я выражаю <a href="/soglasie-na-obrabotku-personalnyh-dannyh/" target="_blank">Согласие на передачу и обработку персональных данных</a>, в соответствии с <a href="/privacy-policy/" target="_blank">Политикой конфиденциальности</a>
                    </div>
                </label>
            </div>

            <div class="form__submit">
                <button type="submit" class="btn">Отправить</button>
            </div>
        </form>
    </div>
</div><!--/noindex-->